Revit 2026 API

# PlanCircuitSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PlanCircuitSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
PlanCircuitSetIterator()
```
```fsharp
new : unit -> PlanCircuitSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

PlanCircuitSetIterator Class

Autodesk.Revit.DB Namespace